[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
!
"
#
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
<
=
>
?
[
]
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
±
—
…
→
##o
##b
##x
##c
##e
##l
##s
##2
##i
##g
##n
##d
##r
##u
##p
##m
##v
##1
##t
##a
##f
##z
##7
##y
##w
##h
##q
##0
##5
##9
##4
##6
##8
##k
##3
##j
##on
##er
th
##at
##es
##in
##one
##nd
none
##or
##al
##ed
##as
the
##it
##ion
py
##ing
##st
##en
##ar
in
re
##and
##le
##ro
##an
pand
##ec
pandas
co
##um
##et
##il
is
st
##is
##th
##am
of
##re
to
##ul
##ad
##ve
##ue
##ly
##ers
##ow
##ut
##ent
##thon
on
ex
##ata
##ex
this
ht
##ab
##ch
##mp
##ersion
do
be
##ot
version
al
and
##yp
as
##ic
ch
##ith
##all
de
for
##py
##se
python
ind
inst
##ay
col
##ort
or
index
##ps
doc
ha
val
##est
##ug
rep
##ate
data
num
not
with
##ib
##ur
##ver
install
con
pd
##ge
##ame
have
wh
##el
##ml
##ip
##eck
it
##00
##umn
##ype
column
tab
##ist
##ation
##im
##pl
##ect
##row
df
##tps
that
https
ad
##ir
##un
##ment
##ql
all
##tion
read
html
na
pro
##ail
##fr
##uld
check
datafr
##ol
##ult
dt
fil
imp
op
int
docs
bug
if
##ig
##pp
##ess
ma
pr
tr
##ting
dataframe
po
##ould
##em
##lo
##ray
iss
exist
dev
columns
row
##ce
##data
pyar
pydata
str
org
value
true
pyarrow
10
but
cs
fal
tim
##ew
##qu
##ine
dtype
issue
csv
false
##ead
##ard
com
report
##ails
det
gro
##les
##age
fill
grou
ar
lo
##id
##ies
##art
tables
by
so
us
##64
##ally
exists
un
##od
##bc
##ls
##if
##ke
##ory
##arqu
##ang
versions
chun
conf
details
##arquet
chunk
01
64
are
get
res
##lib
##ss
##med
##ta
##ac
##ere
##irmed
group
confirmed
00
20
an
sh
spl
sql
##ri
##ple
##pec
##tur
##int
start
##read
installed
post
split
bo
can
dri
en
fi
os
ta
##uc
##ues
##av
##fs
##ast
##ity
pyt
retur
exam
adbc
driver
return
des
flo
has
ke
lin
##pect
##ated
stor
##able
##ible
add
take
float
12
app
date
lat
mem
sug
##bo
##cr
##cess
##gest
##rit
##mit
##ach
comp
values
when
process
checks
example
descr
memory
suggest
aw
new
per
ran
ver
wor
would
##20
##ive
##pr
##for
##hav
##edel
##ase
##ions
##array
##lement
##ree
behav
numpy
##iption
import
##igh
main
rows
timedel
array
loc
getting
202
should
started
description
range
timedelta
mult
mod
su
ut
##ber
##ever
##gr
##me
##eric
then
##rod
expect
##ays
checked
##ign
print
string
##ack
storage
latest
behavi
##ight
bu
gith
out
parquet
sc
##ou
##low
##ub
##ure
##75
##52
##eries
##are
##andard
##ument
been
##ypo
##ice
commit
result
bool
file
key
work
##roduc
expected
behavior
buil
github
ac
bl
bit
cy
dat
fast
kn
nan
pip
si
use
##by
##gn
##ust
##te
##au
##32
##ats
##ord
##ite
rele
##ank
##own
only
##chine
##mpt
does
ass
installing
implement
machine
groupby
splitting
aware
multip
build
blank
abo
br
bec
each
fro
gen
head
lang
mat
x8
you
##op
##ok
##new
##df
##pment
##1b
##a2
##fa
##7f
##ind
##ality
##ition
##anch
stack
##velo
##chem
alread
develo
##python
instead
reproduc
numeric
whats
allow
oper
open
reported
some
any
2025
cython
##ause
release
multiple
branch
from
x86
already
development
reproducible
whatsnew
14
26
ag
bs
bot
cal
call
days
et
fun
fail
fss
gc
hypo
ipython
jin
just
lx
lc
lit
man
np
ob
odf
ps
qt
sp
s3
same
type
xl
xls
xarray
zst
##ba
##xl
##xw
##xls
##cop
##end
##la
##len
##so
##sql
##sfs
##ipy
##g2
##rd
##parquet
##my
##t5
##tle
##tlen
##ycop
##hin
##qt5
##5lib
##ject
##ja2
##esis
##esql
##ore
##ale
##alchem
pyread
pyice
pyxls
pymy
pyqt5
##stat
##etim
##thesis
##ames
##amine
##ulate
##util
##expr
##otlib
form
##pyxl
document
numba
numexpr
table
tabulate
##plotlib
reading
html5lib
prob
inter
dev0
byte
sqlite
sqlalchem
post0
postgr
pytz
pytest
lines
dateutil
##riter
processor
very
locale
utf
##berg
scipy
bits
datetim
fastparquet
simp
##order
assign
because
matplotlib
operation
openpyxl
bs4
bottlen
calamine
etree
fsspec
gcsfs
hypothesis
jinja2
lxml
little
odfpy
psycop
qtpy
sphin
s3fs
xlrd
xlsxw
zstandard
pyreadstat
pyiceberg
pyxlsb
pymysql
documentation
byteorder
sqlalchemy
postgresql
bottleneck
psycopg2
sphinx
xlsxwriter
11
cate
cur
dir
gu
how
ign
list
might
no
ns
set
series
##cl
##ction
##lated
##iz
##ied
##de
##ror
##rent
##mo
##ter
##ff
##9b
##92
##83
than
there
remo
##ance
##ull
##ext
##ypes
chang
naive
##old
files
option
times
unit
apply
##form
function
categ
current
##clu
15
at
fre
go
more
oth
par
rat
se
sk
sec
spec
we
writ
##e0
##ich
##ux
##pend
##1a
##tu
##a75
##ae0
##87f
##3d
##erm
##ates
##ed0
##enc
##ant
##ily
ste
one
##ably
also
##ically
valid
where
##0000
##ectly
##pport
existing
##ide
##ified
returns
linux
suggestions
support
header
##fault
agg
object
format
simpl
functionality
##clud
freq
other
skip
##a7587f
##a7587fed0
17
100
am
ci
empt
fe
fla
gb
here
hold
id
le
me
mes
min
non
pre
qu
ra
sever
term
was
##os
##ost
##eg
##26
##ia
##ner
##put
##af
##ain
##34
thin
##ature
them
inv
could
states
##ises
##amet
befor
depend
default
conv
cont
##rows
dtypes
integ
poss
arg
user
chunks
reset
fix
addition
float64
comple
timedelta64
such
know
above
##index
datetime
operations
ignor
##ffect
paramet
empty
feature
flag
mean
meson
raises
several
think
before
integer
09
23
46
ab
ap
cas
cre
dy
dis
er
ever
fam
fol
fails
he
im
jo
lar
lead
mu
met
name
never
names
over
pree
pull
sm
s1
smp
sel
saf
tz
tw
tut
text
way
wind
want
##oo
##out
##x1
##ep
##ial
##ient
##nam
##d9
##d64
##uine
##port
##ved
##ten
##type
##fer
##74
##ward
##her
##55
##68
##80
##30
tho
##nder
##ass
##str
requ
##lem
##related
##report
##ows
expl
##ices
##icit
indices
number
##urce
installation
cons
which
##el64
iter
##ples
readable
dataframes
opt
intel64
##pping
##ession
max
prs
pres
time
groups
source
users
usage
unrelated
##ify
##ific
010000
##act
##intel
eng
adding
compat
processing
memoryreport
perf
##20f
timedeltaindex
model
utc
output
##lowing
known
implementation
about
genuine
##oks
stacked
manu
probably
problem
directly
##ize
remove
changes
timeseries
category
currently
rather
see
stepping
##cluding
1000
amd64
dependenc
additional
complex
cases
dynam
disc
error
family
following
job
large
much
preempt
small
self
safe
two
windows
genuineintel
dynamic
13
183
2a7587fed0
31
50
526
652
abc
affect
bar
back
cor
case
don
dif
dia
es
eas
element
fir
foo
g2
gate
hand
io
li
lab
lib
mer
ment
may
most
ne
nd
oh
pat
part
pass
red
s2
sin
sum
sol
slow
typ
typo
up
under
wel
xy
##ole
##bf
##b80
##x20
##cast
##e6
##e1b
##e1a
##e3d
##lc
##lis
##less
##sition
##200
##ione
##ially
##gin
##nal
##ds
##d52
##dtype
##dbf
##res
##rib
##ving
##vid
##12
##1e1b
##ty
##tically
##a20f
##flow
##zes
##70
##7e3d
##7d52
##hod
##083
##074
##592
##97f
##9074
##820
##81b
##3ae0
##error
##erved
##ator
##ative
##orial
##aly
##ence
##ary
rec
really
regr
related
##rop
##ross
##roach
coun
code
##ets
##ill
state
standard
still
##ading
##ute
##utions
##ently
##ab2
begin
alg
align
def
cols
col2
col1
indexes
happ
##ures
##urity
##vert
convert
##els
intro
position
arrow
loading
chunking
##tain
analy
##pecially
boole
enh
keep
stored
float32
1252
approach
perform
vertically
arrays
mode
##7568
works
action
actu
across
##32a20f
doesn
generic
##1bdbf
##face
26200
caller
failing
failures
internal
interface
assignment
dirty
however
##tern
##9b34
##9b1bdbf
##92e1a
options
united
categor
151
security
specific
write
##ae0e6
##3d592
supported
idx
quest
invol
conversion
context
possible
argument
ignored
parameter
ab9074
every
method
tutorial
##d9e
##55ab2
##string
optim
englis
compatible
dependencies
discard
jobs
2a7587fed01e1b
diagn
especially
first
g2a7587fed0
like
labels
mentione
need
ohlc
since
solutions
well
##b807568
##ribute
##7e3dae0e6
##7d523d592
##083820
##81b92e1a
##3ae055ab2
regression
happen
boolean
performance
##32a20fd9e
##9b34b
##9b1bdbf083820
ab90747e3dae0e6
tutorials
english
2a7587fed01e1b7d523d592
mentioned
##b8075689b34b
##81b92e1a32a20fd9e
##9b1bdbf083820b8075689b34b
ab90747e3dae0e69b1bdbf083820b8075689b34b
2a7587fed01e1b7d523d59281b92e1a32a20fd9e
04
19
16
18
1x1
24
200
37
41
49
44
500
575
62
ast
bas
ben
cl
cer
card
cast
dur
down
drop
eith
ela
effect
fr
ge
git
grow
ho
hum
lon
len
med
mar
mic
must
null
nrows
oc
ow
pl
pu
pa
put
sr
sam
sav
side
tec
types
ub
upl
vul
via
ws
wid
zer
##oad
##our
##bb
##cat
##cur
##ear
##eated
##l2
##li
##list
##licit
##sh
##sion
##served
##io
##iq
##ile
##ire
##iod
##gth
##nec
##not
##nically
##day
##down
##rectly
##up
##und
##ule
##uably
##mon
##vir
##vance
##1d
##197f
##ted
##tribute
##aps
##ft
##ful
##ways
##hold
##hnically
##06
##59
##91
##93
##4s
##8s
##ken
##35
##33
##onment
##onds
##erate
thu
thres
##atform
##inality
##enient
inform
including
##rove
##roso
##ecut
cook
##iler
##ility
isn
std
stable
##thing
off
tolist
today
##lying
##entified
ext
exten
excluding
##chment
alt
altern
always
aside
##ical
##icient
##psed
docstring
##ugh
repeated
note
without
##ibly
concat
who
why
##ations
advance
##untu
prop
provid
impact
implicit
improve
introduc
price
try
##ems
issues
struc
valueerror
106
comment
detect
##idance
som
uses
using
uniq
unnec
##ifies
gets
##tachment
short
cannot
envir
##uction
examples
returned
append
appear
later
##bose
##book
##mitted
suggested
suggestion
newly
period
permitted
verbose
##2026
##pret
location
2024
2026
multi
module
modifies
strings
keys
working
datas
sizes
useful
##322
assets
headers
again
calls
many
observed
interpret
datetimes
simply
assigned
guard
guide
guidance
ignore
setup
##fficient
removing
changing
optionally
applying
attribute
attachment
goes
good
ratio
seconds
specified
writing
##1a197f
steps
validation
validated
supporting
simplest
simplify
##cluded
skiprows
identified
lev
terms
##ostic
##nerab
convenient
possibly
arguably
chunksize
ignores
parameters
means
api
create
height
img
image
overflow
##x10
those
though
requir
require
explain
explicit
consecut
iterator
present
manual
manually
6522
backward
correctly
differ
handle
libr
merge
ndarray
path
passed
reduction
slowdown
typing
underlying
counter
algos
aligned
actionable
actual
categorical
idxm
questions
involve
optimiz
diagnostic
astype
bench
clar
certain
cardinality
during
downcast
either
elapsed
effects
frame
ge3ae055ab2
git2026
growing
hooks
human
long
length
medi
microso
occur
own
platform
push
src
technically
ubuntu
upload
vulnerab
wsl2
width
zero
##061a197f
threshold
cookbook
extension
alternative
introduced
unique
unnecess
environment
periods
attachments
consecutive
git20260
microsoft
06
08
00000
1x
1322
22
21
25
28
292
32
30
35
420
4d9
59
56
534
5bb
6e
65
69
635
700
732
759
793
82
87
89
84
9c
9d
99
930
av
af
apr
ba
ber
bin
bro
bad
byp
best
big
bac
base
bare
b061a197f
cp
cat
cle
cum
clo
cau
cpython
cause
dec
dum
due
dist
eo
eu
end
ear
evid
e3ae055ab2
efficient
fa
fin
few
f64
fri
full
fact
fund
f91
gi
glib
hon
hor
hit
had
high
hdf
jun
let
lot
lay
lim
less
line
luc
md
my
mis
mess
nat
nas
nul
nic
nice
nich
native
omit
pe
pers
pot
pol
pure
pain
rf
rul
rang
right
rich
roo
r30
sl
sw
sit
sing
san
sil
sent
say
sur
sem
says
schem
ts
tre
tue
test
tel
upp
vs
var
wr
war
wis
ways
yi
your
±in
##om
##ose
##ops
##over
##oid
##ople
##ome
##bp
##b1
##bst
##b68
##b322
##xown
##c2
##c1
##ct
##ca
##c4
##c8
##cle
##cel
##cord
##caf
##cbb
##eve
##eps
##efficient
##lf
##lin
##lic
##lies
##ses
##sing
##sum
##set
##sest
##spect
##2a
##28
##235
##ier
##iou
##gs
##ged
##gard
##gree
##gations
##ns
##ny
##ning
##da
##d5
##date
##dition
##red
##ract
##uce
##uage
##uss
##uple
##pe
##pt
##ped
##ping
##par
##ms
##mas
##mot
##ves
##val
##vant
##viou
##1s
##10
##15
##100
##ts
##tes
##tly
##tally
##tang
##ture
##ax
##a8
##ave
##aight
##ape
##fo
##fic
##fession
##filer
##ze
##zone
##zdtype
##7s
##79
##700
##7c1
##72a
##yon
##yle
##word
##hat
##hing
##how
##haps
##hape
##02
##01
##5d
##51a
##983
##9ca
##97c1
##49
##44
##4cbb
##472a
##63
##6ec
##612
##691
##6b322
##6700
##84
##8b68
##828
##330
##370
##36ec
##ontally
##eral
##ered
thes
throws
##ating
##ines
##ined
##ining
##inel
##inting
##inct
##nded
##nding
nonetype
##orith
##orize
##alar
##ason
they
their
##itut
##itch
##itation
##ities
##itory
##itions
##ionable
##ings
##sts
##stand
##enate
##eness
##ared
##arly
##arting
##aries
##arou
##arily
##areness
inclu
input
infer
included
inefficient
inspect
info
ref
reach
reject
refer
render
regard
reason
##anning
##ecation
##ecac
cost
cover
couple
##umerate
##eties
##etzdtype
##ething
##ilities
style
starting
##ising
##isation
##isions
##ams
often
##reme
##regations
tos
top
tool
##aded
##adata
##vels
##ents
##ented
##entation
##ential
once
exce
exte
excluded
excel
##ches
##chang
doing
being
below
beli
beyon
alone
##icy
##ictly
depr
deep
demon
degree
force
forward
##sequ
##seable
##self
indexing
having
##estig
repro
repla
repos
repres
##ately
##atever
##ibe
##ural
contain
condition
consequ
what
while
whatever
##elds
##elines
its
items
##00x20
##0001
##istently
##plied
reader
prod
progr
project
promot
profession
##ulty
into
introd
bugs
##igure
##essure
prone
printing
pressure
point
##loaded
devs
straight
strictly
1079
1084
##ewhat
##ineers
##eader
common
reporting
determ
loss
look
looks
loops
logs
##idered
used
usable
unable
unless
unset
unchang
##kend
configure
64691
respect
reshape
##libs
show
shown
##tured
splitter
both
bound
enumerate
taken
##avy
returning
design
keeps
link
##pective
added
additions
floats
##books
##ache
compos
compile
compiler
complic
compared
describe
suggests
aws
away
awareness
perhaps
worth
worse
##prising
##forward
behaves
important
modified
subst
##mending
stringarray
stringdtype
behaviour
scop
scalar
scanning
##52472a
results
keyword
workarou
built
accord
cycle
fastest
knxown
nans
pipelines
##tempt
relevant
implemented
implementing
multiplies
builds
become
generate
general
heading
language
match
##a2de
stackover
operator
somehow
140
147s
26100
calling
callers
callable
funny
failure
manage
manner
formats
datetimetzdtype
guess
nothing
setting
setde
##izontally
##depend
##9b59
removal
changed
1500x20
attempt
goal
going
parseable
seems
separ
secure
specify
webp
written
##tuples
##ency
##ences
supports
aggregations
simpler
simplified
skipped
174s
1001d
gb061a197f
least
leave
levels
previou
quite
quality
##osed
##345d
invented
investig
depending
defaults
contribute
contents
completes
knowing
datetime64
datetimeindex
flags
ability
applied
apache
created
creates
heart
heavy
leads
metadata
overall
overloaded
textfiler
wanted
##74caf
##5532
##303
##strating
consistently
considered
iterable
itertuples
preserved
presence
timezone
##ification
engineers
##20f9ca
outputs
1000x20
1000x10
dependency
complexity
discuss
largely
smaller
smallest
316
508s
65212
affects
affected
corner
diffic
easy
easily
easier
handed
libs
merged
mostly
pattern
slower
typed
upcast
update
understand
##1252
##7051a
##70345d
recently
recom
rectang
##rope
counts
beginner
algorith
alignment
defined
positional
positionally
arrowstring
analyzes
analyze
analysts
keeping
approaches
actually
generically
internaldepend
categories
questionable
involved
everything
methods
optimize
discards
discarded
diagnose
likely
needs
needing
happens
200s
4180
411s
49612
49828
4449
500x20
500x10
624s
based
basically
putmas
sample
samples
saved
savings
##lier
##1d9b59
##9374caf
informal
information
stdout
extract
extreme
repeatedly
notebooks
concatenate
proper
proposed
provided
providing
improvement
structure
structured
detects
something
somewhat
appends
appears
dataset
datasets
against
interpreted
interpreting
guards
attributeerror
requires
requiring
explains
explicitly
65225
65224
different
library
libraries
reductions
categoricaldtype
idxmin
idxmax
optimization
optimizations
diagnostics
clarify
clarification
downcasts
median
medium
occurs
pushes
pushed
vulnerability
vulnerabilities
extensionarray
unnecessary
unnecessarily
consecutively
git20260330
git20260303
000000001
1xn
292s
358s
4d9d
5670345d
53433
5bb235
6e44
694cbb
63533
759s
7938
827
89x
9cb1
9d02
930s
avoid
after
baz
berlin
binary
broken
bypass
backend
b061a197f1d9b59
cp1252
catches
clearly
cumsum
closest
causes
decisions
dumping
distinct
eof
europe
earlier
evidence
e3ae055ab220f9ca
faq
finite
fewer
f64da
factorize
f91c8
gives
glibc2
honor
horizontally
layout
limitation
luck
myself
missing
message
natural
nulls
niceties
niche
omitting
people
perspective
potential
policy
purely
rfc
rules
ranges
room
r306700
slight
switch
sites
single
sanity
silently
sentinel
saying
surprising
schema
tslibs
treated
testing
tells
upper
wraps
warns
wise
yields
±inf
##c463
##d510
##15a2de
##9836b322
##97c18
##8b6852472a
##370d510
##36ececac
these
##ituted
include
inferred
reaching
rejects
reference
rendered
regardless
covering
except
extended
believe
beyond
deprecation
demonstrating
replace
repository
representation
consequences
programs
promotion
professional
introduce
straightforward
determining
lossless
unchanged
composable
complicated
importantly
substituted
scope
workaround
according
generalisation
stackoverflow
operators
setdefault
separately
webpage
1001d15a2de
gb061a197f1
previous
investigated
textfilereader
discussion
difficulty
##7051a3
recommending
rectangles
algorithms
arrowstringarray
internaldependency
putmask
##9374cafc463
extremely
5bb2357051a3
694cbb6
b061a197f1d9b598b6852472a
e3ae055ab220f9ca9836b322
f64da97f
f91c8a8
r3067005532
##36ececac370d510
1001d15a2de8
##9374cafc46397c18
b061a197f1d9b598b6852472a36ececac370d510
e3ae055ab220f9ca9836b3229374cafc46397c18
