{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 256,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 256
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "[": 35,
      "]": 36,
      "_": 37,
      "`": 38,
      "a": 39,
      "b": 40,
      "c": 41,
      "d": 42,
      "e": 43,
      "f": 44,
      "g": 45,
      "h": 46,
      "i": 47,
      "j": 48,
      "k": 49,
      "l": 50,
      "m": 51,
      "n": 52,
      "o": 53,
      "p": 54,
      "q": 55,
      "r": 56,
      "s": 57,
      "t": 58,
      "u": 59,
      "v": 60,
      "w": 61,
      "x": 62,
      "y": 63,
      "z": 64,
      "{": 65,
      "|": 66,
      "}": 67,
      "~": 68,
      "±": 69,
      "—": 70,
      "…": 71,
      "→": 72,
      "##o": 73,
      "##b": 74,
      "##x": 75,
      "##c": 76,
      "##e": 77,
      "##l": 78,
      "##s": 79,
      "##2": 80,
      "##i": 81,
      "##g": 82,
      "##n": 83,
      "##d": 84,
      "##r": 85,
      "##u": 86,
      "##p": 87,
      "##m": 88,
      "##v": 89,
      "##1": 90,
      "##t": 91,
      "##a": 92,
      "##f": 93,
      "##z": 94,
      "##7": 95,
      "##y": 96,
      "##w": 97,
      "##h": 98,
      "##q": 99,
      "##0": 100,
      "##5": 101,
      "##9": 102,
      "##4": 103,
      "##6": 104,
      "##8": 105,
      "##k": 106,
      "##3": 107,
      "##j": 108,
      "##on": 109,
      "##er": 110,
      "th": 111,
      "##at": 112,
      "##es": 113,
      "##in": 114,
      "##one": 115,
      "##nd": 116,
      "none": 117,
      "##or": 118,
      "##al": 119,
      "##ed": 120,
      "##as": 121,
      "the": 122,
      "##it": 123,
      "##ion": 124,
      "py": 125,
      "##ing": 126,
      "##st": 127,
      "##en": 128,
      "##ar": 129,
      "in": 130,
      "re": 131,
      "##and": 132,
      "##le": 133,
      "##ro": 134,
      "##an": 135,
      "pand": 136,
      "##ec": 137,
      "pandas": 138,
      "co": 139,
      "##um": 140,
      "##et": 141,
      "##il": 142,
      "is": 143,
      "st": 144,
      "##is": 145,
      "##th": 146,
      "##am": 147,
      "of": 148,
      "##re": 149,
      "to": 150,
      "##ul": 151,
      "##ad": 152,
      "##ve": 153,
      "##ue": 154,
      "##ly": 155,
      "##ers": 156,
      "##ow": 157,
      "##ut": 158,
      "##ent": 159,
      "##thon": 160,
      "on": 161,
      "ex": 162,
      "##ata": 163,
      "##ex": 164,
      "this": 165,
      "ht": 166,
      "##ab": 167,
      "##ch": 168,
      "##mp": 169,
      "##ersion": 170,
      "do": 171,
      "be": 172,
      "##ot": 173,
      "version": 174,
      "al": 175,
      "and": 176,
      "##yp": 177,
      "as": 178,
      "##ic": 179,
      "ch": 180,
      "##ith": 181,
      "##all": 182,
      "de": 183,
      "for": 184,
      "##py": 185,
      "##se": 186,
      "python": 187,
      "ind": 188,
      "inst": 189,
      "##ay": 190,
      "col": 191,
      "##ort": 192,
      "or": 193,
      "index": 194,
      "##ps": 195,
      "doc": 196,
      "ha": 197,
      "val": 198,
      "##est": 199,
      "##ug": 200,
      "rep": 201,
      "##ate": 202,
      "data": 203,
      "num": 204,
      "not": 205,
      "with": 206,
      "##ib": 207,
      "##ur": 208,
      "##ver": 209,
      "install": 210,
      "con": 211,
      "pd": 212,
      "##ge": 213,
      "##ame": 214,
      "have": 215,
      "wh": 216,
      "##el": 217,
      "##ml": 218,
      "##ip": 219,
      "##eck": 220,
      "it": 221,
      "##00": 222,
      "##umn": 223,
      "##ype": 224,
      "column": 225,
      "tab": 226,
      "##ist": 227,
      "##ation": 228,
      "##im": 229,
      "##pl": 230,
      "##ect": 231,
      "##row": 232,
      "df": 233,
      "##tps": 234,
      "that": 235,
      "https": 236,
      "ad": 237,
      "##ir": 238,
      "##un": 239,
      "##ment": 240,
      "##ql": 241,
      "all": 242,
      "##tion": 243,
      "read": 244,
      "html": 245,
      "na": 246,
      "pro": 247,
      "##ail": 248,
      "##fr": 249,
      "##uld": 250,
      "check": 251,
      "datafr": 252,
      "##ol": 253,
      "##ult": 254,
      "dt": 255,
      "fil": 256,
      "imp": 257,
      "op": 258,
      "int": 259,
      "docs": 260,
      "bug": 261,
      "if": 262,
      "##ig": 263,
      "##pp": 264,
      "##ess": 265,
      "ma": 266,
      "pr": 267,
      "tr": 268,
      "##ting": 269,
      "dataframe": 270,
      "po": 271,
      "##ould": 272,
      "##em": 273,
      "##lo": 274,
      "##ray": 275,
      "iss": 276,
      "exist": 277,
      "dev": 278,
      "columns": 279,
      "row": 280,
      "##ce": 281,
      "##data": 282,
      "pyar": 283,
      "pydata": 284,
      "str": 285,
      "org": 286,
      "value": 287,
      "true": 288,
      "pyarrow": 289,
      "10": 290,
      "but": 291,
      "cs": 292,
      "fal": 293,
      "tim": 294,
      "##ew": 295,
      "##qu": 296,
      "##ine": 297,
      "dtype": 298,
      "issue": 299,
      "csv": 300,
      "false": 301,
      "##ead": 302,
      "##ard": 303,
      "com": 304,
      "report": 305,
      "##ails": 306,
      "det": 307,
      "gro": 308,
      "##les": 309,
      "##age": 310,
      "fill": 311,
      "grou": 312,
      "ar": 313,
      "lo": 314,
      "##id": 315,
      "##ies": 316,
      "##art": 317,
      "tables": 318,
      "by": 319,
      "so": 320,
      "us": 321,
      "##64": 322,
      "##ally": 323,
      "exists": 324,
      "un": 325,
      "##od": 326,
      "##bc": 327,
      "##ls": 328,
      "##if": 329,
      "##ke": 330,
      "##ory": 331,
      "##arqu": 332,
      "##ang": 333,
      "versions": 334,
      "chun": 335,
      "conf": 336,
      "details": 337,
      "##arquet": 338,
      "chunk": 339,
      "01": 340,
      "64": 341,
      "are": 342,
      "get": 343,
      "res": 344,
      "##lib": 345,
      "##ss": 346,
      "##med": 347,
      "##ta": 348,
      "##ac": 349,
      "##ere": 350,
      "##irmed": 351,
      "group": 352,
      "confirmed": 353,
      "00": 354,
      "20": 355,
      "an": 356,
      "sh": 357,
      "spl": 358,
      "sql": 359,
      "##ri": 360,
      "##ple": 361,
      "##pec": 362,
      "##tur": 363,
      "##int": 364,
      "start": 365,
      "##read": 366,
      "installed": 367,
      "post": 368,
      "split": 369,
      "bo": 370,
      "can": 371,
      "dri": 372,
      "en": 373,
      "fi": 374,
      "os": 375,
      "ta": 376,
      "##uc": 377,
      "##ues": 378,
      "##av": 379,
      "##fs": 380,
      "##ast": 381,
      "##ity": 382,
      "pyt": 383,
      "retur": 384,
      "exam": 385,
      "adbc": 386,
      "driver": 387,
      "return": 388,
      "des": 389,
      "flo": 390,
      "has": 391,
      "ke": 392,
      "lin": 393,
      "##pect": 394,
      "##ated": 395,
      "stor": 396,
      "##able": 397,
      "##ible": 398,
      "add": 399,
      "take": 400,
      "float": 401,
      "12": 402,
      "app": 403,
      "date": 404,
      "lat": 405,
      "mem": 406,
      "sug": 407,
      "##bo": 408,
      "##cr": 409,
      "##cess": 410,
      "##gest": 411,
      "##rit": 412,
      "##mit": 413,
      "##ach": 414,
      "comp": 415,
      "values": 416,
      "when": 417,
      "process": 418,
      "checks": 419,
      "example": 420,
      "descr": 421,
      "memory": 422,
      "suggest": 423,
      "aw": 424,
      "new": 425,
      "per": 426,
      "ran": 427,
      "ver": 428,
      "wor": 429,
      "would": 430,
      "##20": 431,
      "##ive": 432,
      "##pr": 433,
      "##for": 434,
      "##hav": 435,
      "##edel": 436,
      "##ase": 437,
      "##ions": 438,
      "##array": 439,
      "##lement": 440,
      "##ree": 441,
      "behav": 442,
      "numpy": 443,
      "##iption": 444,
      "import": 445,
      "##igh": 446,
      "main": 447,
      "rows": 448,
      "timedel": 449,
      "array": 450,
      "loc": 451,
      "getting": 452,
      "202": 453,
      "should": 454,
      "started": 455,
      "description": 456,
      "range": 457,
      "timedelta": 458,
      "mult": 459,
      "mod": 460,
      "su": 461,
      "ut": 462,
      "##ber": 463,
      "##ever": 464,
      "##gr": 465,
      "##me": 466,
      "##eric": 467,
      "then": 468,
      "##rod": 469,
      "expect": 470,
      "##ays": 471,
      "checked": 472,
      "##ign": 473,
      "print": 474,
      "string": 475,
      "##ack": 476,
      "storage": 477,
      "latest": 478,
      "behavi": 479,
      "##ight": 480,
      "bu": 481,
      "gith": 482,
      "out": 483,
      "parquet": 484,
      "sc": 485,
      "##ou": 486,
      "##low": 487,
      "##ub": 488,
      "##ure": 489,
      "##75": 490,
      "##52": 491,
      "##eries": 492,
      "##are": 493,
      "##andard": 494,
      "##ument": 495,
      "been": 496,
      "##ypo": 497,
      "##ice": 498,
      "commit": 499,
      "result": 500,
      "bool": 501,
      "file": 502,
      "key": 503,
      "work": 504,
      "##roduc": 505,
      "expected": 506,
      "behavior": 507,
      "buil": 508,
      "github": 509,
      "ac": 510,
      "bl": 511,
      "bit": 512,
      "cy": 513,
      "dat": 514,
      "fast": 515,
      "kn": 516,
      "nan": 517,
      "pip": 518,
      "si": 519,
      "use": 520,
      "##by": 521,
      "##gn": 522,
      "##ust": 523,
      "##te": 524,
      "##au": 525,
      "##32": 526,
      "##ats": 527,
      "##ord": 528,
      "##ite": 529,
      "rele": 530,
      "##ank": 531,
      "##own": 532,
      "only": 533,
      "##chine": 534,
      "##mpt": 535,
      "does": 536,
      "ass": 537,
      "installing": 538,
      "implement": 539,
      "machine": 540,
      "groupby": 541,
      "splitting": 542,
      "aware": 543,
      "multip": 544,
      "build": 545,
      "blank": 546,
      "abo": 547,
      "br": 548,
      "bec": 549,
      "each": 550,
      "fro": 551,
      "gen": 552,
      "head": 553,
      "lang": 554,
      "mat": 555,
      "x8": 556,
      "you": 557,
      "##op": 558,
      "##ok": 559,
      "##new": 560,
      "##df": 561,
      "##pment": 562,
      "##1b": 563,
      "##a2": 564,
      "##fa": 565,
      "##7f": 566,
      "##ind": 567,
      "##ality": 568,
      "##ition": 569,
      "##anch": 570,
      "stack": 571,
      "##velo": 572,
      "##chem": 573,
      "alread": 574,
      "develo": 575,
      "##python": 576,
      "instead": 577,
      "reproduc": 578,
      "numeric": 579,
      "whats": 580,
      "allow": 581,
      "oper": 582,
      "open": 583,
      "reported": 584,
      "some": 585,
      "any": 586,
      "2025": 587,
      "cython": 588,
      "##ause": 589,
      "release": 590,
      "multiple": 591,
      "branch": 592,
      "from": 593,
      "x86": 594,
      "already": 595,
      "development": 596,
      "reproducible": 597,
      "whatsnew": 598,
      "14": 599,
      "26": 600,
      "ag": 601,
      "bs": 602,
      "bot": 603,
      "cal": 604,
      "call": 605,
      "days": 606,
      "et": 607,
      "fun": 608,
      "fail": 609,
      "fss": 610,
      "gc": 611,
      "hypo": 612,
      "ipython": 613,
      "jin": 614,
      "just": 615,
      "lx": 616,
      "lc": 617,
      "lit": 618,
      "man": 619,
      "np": 620,
      "ob": 621,
      "odf": 622,
      "ps": 623,
      "qt": 624,
      "sp": 625,
      "s3": 626,
      "same": 627,
      "type": 628,
      "xl": 629,
      "xls": 630,
      "xarray": 631,
      "zst": 632,
      "##ba": 633,
      "##xl": 634,
      "##xw": 635,
      "##xls": 636,
      "##cop": 637,
      "##end": 638,
      "##la": 639,
      "##len": 640,
      "##so": 641,
      "##sql": 642,
      "##sfs": 643,
      "##ipy": 644,
      "##g2": 645,
      "##rd": 646,
      "##parquet": 647,
      "##my": 648,
      "##t5": 649,
      "##tle": 650,
      "##tlen": 651,
      "##ycop": 652,
      "##hin": 653,
      "##qt5": 654,
      "##5lib": 655,
      "##ject": 656,
      "##ja2": 657,
      "##esis": 658,
      "##esql": 659,
      "##ore": 660,
      "##ale": 661,
      "##alchem": 662,
      "pyread": 663,
      "pyice": 664,
      "pyxls": 665,
      "pymy": 666,
      "pyqt5": 667,
      "##stat": 668,
      "##etim": 669,
      "##thesis": 670,
      "##ames": 671,
      "##amine": 672,
      "##ulate": 673,
      "##util": 674,
      "##expr": 675,
      "##otlib": 676,
      "form": 677,
      "##pyxl": 678,
      "document": 679,
      "numba": 680,
      "numexpr": 681,
      "table": 682,
      "tabulate": 683,
      "##plotlib": 684,
      "reading": 685,
      "html5lib": 686,
      "prob": 687,
      "inter": 688,
      "dev0": 689,
      "byte": 690,
      "sqlite": 691,
      "sqlalchem": 692,
      "post0": 693,
      "postgr": 694,
      "pytz": 695,
      "pytest": 696,
      "lines": 697,
      "dateutil": 698,
      "##riter": 699,
      "processor": 700,
      "very": 701,
      "locale": 702,
      "utf": 703,
      "##berg": 704,
      "scipy": 705,
      "bits": 706,
      "datetim": 707,
      "fastparquet": 708,
      "simp": 709,
      "##order": 710,
      "assign": 711,
      "because": 712,
      "matplotlib": 713,
      "operation": 714,
      "openpyxl": 715,
      "bs4": 716,
      "bottlen": 717,
      "calamine": 718,
      "etree": 719,
      "fsspec": 720,
      "gcsfs": 721,
      "hypothesis": 722,
      "jinja2": 723,
      "lxml": 724,
      "little": 725,
      "odfpy": 726,
      "psycop": 727,
      "qtpy": 728,
      "sphin": 729,
      "s3fs": 730,
      "xlrd": 731,
      "xlsxw": 732,
      "zstandard": 733,
      "pyreadstat": 734,
      "pyiceberg": 735,
      "pyxlsb": 736,
      "pymysql": 737,
      "documentation": 738,
      "byteorder": 739,
      "sqlalchemy": 740,
      "postgresql": 741,
      "bottleneck": 742,
      "psycopg2": 743,
      "sphinx": 744,
      "xlsxwriter": 745,
      "11": 746,
      "cate": 747,
      "cur": 748,
      "dir": 749,
      "gu": 750,
      "how": 751,
      "ign": 752,
      "list": 753,
      "might": 754,
      "no": 755,
      "ns": 756,
      "set": 757,
      "series": 758,
      "##cl": 759,
      "##ction": 760,
      "##lated": 761,
      "##iz": 762,
      "##ied": 763,
      "##de": 764,
      "##ror": 765,
      "##rent": 766,
      "##mo": 767,
      "##ter": 768,
      "##ff": 769,
      "##9b": 770,
      "##92": 771,
      "##83": 772,
      "than": 773,
      "there": 774,
      "remo": 775,
      "##ance": 776,
      "##ull": 777,
      "##ext": 778,
      "##ypes": 779,
      "chang": 780,
      "naive": 781,
      "##old": 782,
      "files": 783,
      "option": 784,
      "times": 785,
      "unit": 786,
      "apply": 787,
      "##form": 788,
      "function": 789,
      "categ": 790,
      "current": 791,
      "##clu": 792,
      "15": 793,
      "at": 794,
      "fre": 795,
      "go": 796,
      "more": 797,
      "oth": 798,
      "par": 799,
      "rat": 800,
      "se": 801,
      "sk": 802,
      "sec": 803,
      "spec": 804,
      "we": 805,
      "writ": 806,
      "##e0": 807,
      "##ich": 808,
      "##ux": 809,
      "##pend": 810,
      "##1a": 811,
      "##tu": 812,
      "##a75": 813,
      "##ae0": 814,
      "##87f": 815,
      "##3d": 816,
      "##erm": 817,
      "##ates": 818,
      "##ed0": 819,
      "##enc": 820,
      "##ant": 821,
      "##ily": 822,
      "ste": 823,
      "one": 824,
      "##ably": 825,
      "also": 826,
      "##ically": 827,
      "valid": 828,
      "where": 829,
      "##0000": 830,
      "##ectly": 831,
      "##pport": 832,
      "existing": 833,
      "##ide": 834,
      "##ified": 835,
      "returns": 836,
      "linux": 837,
      "suggestions": 838,
      "support": 839,
      "header": 840,
      "##fault": 841,
      "agg": 842,
      "object": 843,
      "format": 844,
      "simpl": 845,
      "functionality": 846,
      "##clud": 847,
      "freq": 848,
      "other": 849,
      "skip": 850,
      "##a7587f": 851,
      "##a7587fed0": 852,
      "17": 853,
      "100": 854,
      "am": 855,
      "ci": 856,
      "empt": 857,
      "fe": 858,
      "fla": 859,
      "gb": 860,
      "here": 861,
      "hold": 862,
      "id": 863,
      "le": 864,
      "me": 865,
      "mes": 866,
      "min": 867,
      "non": 868,
      "pre": 869,
      "qu": 870,
      "ra": 871,
      "sever": 872,
      "term": 873,
      "was": 874,
      "##os": 875,
      "##ost": 876,
      "##eg": 877,
      "##26": 878,
      "##ia": 879,
      "##ner": 880,
      "##put": 881,
      "##af": 882,
      "##ain": 883,
      "##34": 884,
      "thin": 885,
      "##ature": 886,
      "them": 887,
      "inv": 888,
      "could": 889,
      "states": 890,
      "##ises": 891,
      "##amet": 892,
      "befor": 893,
      "depend": 894,
      "default": 895,
      "conv": 896,
      "cont": 897,
      "##rows": 898,
      "dtypes": 899,
      "integ": 900,
      "poss": 901,
      "arg": 902,
      "user": 903,
      "chunks": 904,
      "reset": 905,
      "fix": 906,
      "addition": 907,
      "float64": 908,
      "comple": 909,
      "timedelta64": 910,
      "such": 911,
      "know": 912,
      "above": 913,
      "##index": 914,
      "datetime": 915,
      "operations": 916,
      "ignor": 917,
      "##ffect": 918,
      "paramet": 919,
      "empty": 920,
      "feature": 921,
      "flag": 922,
      "mean": 923,
      "meson": 924,
      "raises": 925,
      "several": 926,
      "think": 927,
      "before": 928,
      "integer": 929,
      "09": 930,
      "23": 931,
      "46": 932,
      "ab": 933,
      "ap": 934,
      "cas": 935,
      "cre": 936,
      "dy": 937,
      "dis": 938,
      "er": 939,
      "ever": 940,
      "fam": 941,
      "fol": 942,
      "fails": 943,
      "he": 944,
      "im": 945,
      "jo": 946,
      "lar": 947,
      "lead": 948,
      "mu": 949,
      "met": 950,
      "name": 951,
      "never": 952,
      "names": 953,
      "over": 954,
      "pree": 955,
      "pull": 956,
      "sm": 957,
      "s1": 958,
      "smp": 959,
      "sel": 960,
      "saf": 961,
      "tz": 962,
      "tw": 963,
      "tut": 964,
      "text": 965,
      "way": 966,
      "wind": 967,
      "want": 968,
      "##oo": 969,
      "##out": 970,
      "##x1": 971,
      "##ep": 972,
      "##ial": 973,
      "##ient": 974,
      "##nam": 975,
      "##d9": 976,
      "##d64": 977,
      "##uine": 978,
      "##port": 979,
      "##ved": 980,
      "##ten": 981,
      "##type": 982,
      "##fer": 983,
      "##74": 984,
      "##ward": 985,
      "##her": 986,
      "##55": 987,
      "##68": 988,
      "##80": 989,
      "##30": 990,
      "tho": 991,
      "##nder": 992,
      "##ass": 993,
      "##str": 994,
      "requ": 995,
      "##lem": 996,
      "##related": 997,
      "##report": 998,
      "##ows": 999,
      "expl": 1000,
      "##ices": 1001,
      "##icit": 1002,
      "indices": 1003,
      "number": 1004,
      "##urce": 1005,
      "installation": 1006,
      "cons": 1007,
      "which": 1008,
      "##el64": 1009,
      "iter": 1010,
      "##ples": 1011,
      "readable": 1012,
      "dataframes": 1013,
      "opt": 1014,
      "intel64": 1015,
      "##pping": 1016,
      "##ession": 1017,
      "max": 1018,
      "prs": 1019,
      "pres": 1020,
      "time": 1021,
      "groups": 1022,
      "source": 1023,
      "users": 1024,
      "usage": 1025,
      "unrelated": 1026,
      "##ify": 1027,
      "##ific": 1028,
      "010000": 1029,
      "##act": 1030,
      "##intel": 1031,
      "eng": 1032,
      "adding": 1033,
      "compat": 1034,
      "processing": 1035,
      "memoryreport": 1036,
      "perf": 1037,
      "##20f": 1038,
      "timedeltaindex": 1039,
      "model": 1040,
      "utc": 1041,
      "output": 1042,
      "##lowing": 1043,
      "known": 1044,
      "implementation": 1045,
      "about": 1046,
      "genuine": 1047,
      "##oks": 1048,
      "stacked": 1049,
      "manu": 1050,
      "probably": 1051,
      "problem": 1052,
      "directly": 1053,
      "##ize": 1054,
      "remove": 1055,
      "changes": 1056,
      "timeseries": 1057,
      "category": 1058,
      "currently": 1059,
      "rather": 1060,
      "see": 1061,
      "stepping": 1062,
      "##cluding": 1063,
      "1000": 1064,
      "amd64": 1065,
      "dependenc": 1066,
      "additional": 1067,
      "complex": 1068,
      "cases": 1069,
      "dynam": 1070,
      "disc": 1071,
      "error": 1072,
      "family": 1073,
      "following": 1074,
      "job": 1075,
      "large": 1076,
      "much": 1077,
      "preempt": 1078,
      "small": 1079,
      "self": 1080,
      "safe": 1081,
      "two": 1082,
      "windows": 1083,
      "genuineintel": 1084,
      "dynamic": 1085,
      "13": 1086,
      "183": 1087,
      "2a7587fed0": 1088,
      "31": 1089,
      "50": 1090,
      "526": 1091,
      "652": 1092,
      "abc": 1093,
      "affect": 1094,
      "bar": 1095,
      "back": 1096,
      "cor": 1097,
      "case": 1098,
      "don": 1099,
      "dif": 1100,
      "dia": 1101,
      "es": 1102,
      "eas": 1103,
      "element": 1104,
      "fir": 1105,
      "foo": 1106,
      "g2": 1107,
      "gate": 1108,
      "hand": 1109,
      "io": 1110,
      "li": 1111,
      "lab": 1112,
      "lib": 1113,
      "mer": 1114,
      "ment": 1115,
      "may": 1116,
      "most": 1117,
      "ne": 1118,
      "nd": 1119,
      "oh": 1120,
      "pat": 1121,
      "part": 1122,
      "pass": 1123,
      "red": 1124,
      "s2": 1125,
      "sin": 1126,
      "sum": 1127,
      "sol": 1128,
      "slow": 1129,
      "typ": 1130,
      "typo": 1131,
      "up": 1132,
      "under": 1133,
      "wel": 1134,
      "xy": 1135,
      "##ole": 1136,
      "##bf": 1137,
      "##b80": 1138,
      "##x20": 1139,
      "##cast": 1140,
      "##e6": 1141,
      "##e1b": 1142,
      "##e1a": 1143,
      "##e3d": 1144,
      "##lc": 1145,
      "##lis": 1146,
      "##less": 1147,
      "##sition": 1148,
      "##200": 1149,
      "##ione": 1150,
      "##ially": 1151,
      "##gin": 1152,
      "##nal": 1153,
      "##ds": 1154,
      "##d52": 1155,
      "##dtype": 1156,
      "##dbf": 1157,
      "##res": 1158,
      "##rib": 1159,
      "##ving": 1160,
      "##vid": 1161,
      "##12": 1162,
      "##1e1b": 1163,
      "##ty": 1164,
      "##tically": 1165,
      "##a20f": 1166,
      "##flow": 1167,
      "##zes": 1168,
      "##70": 1169,
      "##7e3d": 1170,
      "##7d52": 1171,
      "##hod": 1172,
      "##083": 1173,
      "##074": 1174,
      "##592": 1175,
      "##97f": 1176,
      "##9074": 1177,
      "##820": 1178,
      "##81b": 1179,
      "##3ae0": 1180,
      "##error": 1181,
      "##erved": 1182,
      "##ator": 1183,
      "##ative": 1184,
      "##orial": 1185,
      "##aly": 1186,
      "##ence": 1187,
      "##ary": 1188,
      "rec": 1189,
      "really": 1190,
      "regr": 1191,
      "related": 1192,
      "##rop": 1193,
      "##ross": 1194,
      "##roach": 1195,
      "coun": 1196,
      "code": 1197,
      "##ets": 1198,
      "##ill": 1199,
      "state": 1200,
      "standard": 1201,
      "still": 1202,
      "##ading": 1203,
      "##ute": 1204,
      "##utions": 1205,
      "##ently": 1206,
      "##ab2": 1207,
      "begin": 1208,
      "alg": 1209,
      "align": 1210,
      "def": 1211,
      "cols": 1212,
      "col2": 1213,
      "col1": 1214,
      "indexes": 1215,
      "happ": 1216,
      "##ures": 1217,
      "##urity": 1218,
      "##vert": 1219,
      "convert": 1220,
      "##els": 1221,
      "intro": 1222,
      "position": 1223,
      "arrow": 1224,
      "loading": 1225,
      "chunking": 1226,
      "##tain": 1227,
      "analy": 1228,
      "##pecially": 1229,
      "boole": 1230,
      "enh": 1231,
      "keep": 1232,
      "stored": 1233,
      "float32": 1234,
      "1252": 1235,
      "approach": 1236,
      "perform": 1237,
      "vertically": 1238,
      "arrays": 1239,
      "mode": 1240,
      "##7568": 1241,
      "works": 1242,
      "action": 1243,
      "actu": 1244,
      "across": 1245,
      "##32a20f": 1246,
      "doesn": 1247,
      "generic": 1248,
      "##1bdbf": 1249,
      "##face": 1250,
      "26200": 1251,
      "caller": 1252,
      "failing": 1253,
      "failures": 1254,
      "internal": 1255,
      "interface": 1256,
      "assignment": 1257,
      "dirty": 1258,
      "however": 1259,
      "##tern": 1260,
      "##9b34": 1261,
      "##9b1bdbf": 1262,
      "##92e1a": 1263,
      "options": 1264,
      "united": 1265,
      "categor": 1266,
      "151": 1267,
      "security": 1268,
      "specific": 1269,
      "write": 1270,
      "##ae0e6": 1271,
      "##3d592": 1272,
      "supported": 1273,
      "idx": 1274,
      "quest": 1275,
      "invol": 1276,
      "conversion": 1277,
      "context": 1278,
      "possible": 1279,
      "argument": 1280,
      "ignored": 1281,
      "parameter": 1282,
      "ab9074": 1283,
      "every": 1284,
      "method": 1285,
      "tutorial": 1286,
      "##d9e": 1287,
      "##55ab2": 1288,
      "##string": 1289,
      "optim": 1290,
      "englis": 1291,
      "compatible": 1292,
      "dependencies": 1293,
      "discard": 1294,
      "jobs": 1295,
      "2a7587fed01e1b": 1296,
      "diagn": 1297,
      "especially": 1298,
      "first": 1299,
      "g2a7587fed0": 1300,
      "like": 1301,
      "labels": 1302,
      "mentione": 1303,
      "need": 1304,
      "ohlc": 1305,
      "since": 1306,
      "solutions": 1307,
      "well": 1308,
      "##b807568": 1309,
      "##ribute": 1310,
      "##7e3dae0e6": 1311,
      "##7d523d592": 1312,
      "##083820": 1313,
      "##81b92e1a": 1314,
      "##3ae055ab2": 1315,
      "regression": 1316,
      "happen": 1317,
      "boolean": 1318,
      "performance": 1319,
      "##32a20fd9e": 1320,
      "##9b34b": 1321,
      "##9b1bdbf083820": 1322,
      "ab90747e3dae0e6": 1323,
      "tutorials": 1324,
      "english": 1325,
      "2a7587fed01e1b7d523d592": 1326,
      "mentioned": 1327,
      "##b8075689b34b": 1328,
      "##81b92e1a32a20fd9e": 1329,
      "##9b1bdbf083820b8075689b34b": 1330,
      "ab90747e3dae0e69b1bdbf083820b8075689b34b": 1331,
      "2a7587fed01e1b7d523d59281b92e1a32a20fd9e": 1332,
      "04": 1333,
      "19": 1334,
      "16": 1335,
      "18": 1336,
      "1x1": 1337,
      "24": 1338,
      "200": 1339,
      "37": 1340,
      "41": 1341,
      "49": 1342,
      "44": 1343,
      "500": 1344,
      "575": 1345,
      "62": 1346,
      "ast": 1347,
      "bas": 1348,
      "ben": 1349,
      "cl": 1350,
      "cer": 1351,
      "card": 1352,
      "cast": 1353,
      "dur": 1354,
      "down": 1355,
      "drop": 1356,
      "eith": 1357,
      "ela": 1358,
      "effect": 1359,
      "fr": 1360,
      "ge": 1361,
      "git": 1362,
      "grow": 1363,
      "ho": 1364,
      "hum": 1365,
      "lon": 1366,
      "len": 1367,
      "med": 1368,
      "mar": 1369,
      "mic": 1370,
      "must": 1371,
      "null": 1372,
      "nrows": 1373,
      "oc": 1374,
      "ow": 1375,
      "pl": 1376,
      "pu": 1377,
      "pa": 1378,
      "put": 1379,
      "sr": 1380,
      "sam": 1381,
      "sav": 1382,
      "side": 1383,
      "tec": 1384,
      "types": 1385,
      "ub": 1386,
      "upl": 1387,
      "vul": 1388,
      "via": 1389,
      "ws": 1390,
      "wid": 1391,
      "zer": 1392,
      "##oad": 1393,
      "##our": 1394,
      "##bb": 1395,
      "##cat": 1396,
      "##cur": 1397,
      "##ear": 1398,
      "##eated": 1399,
      "##l2": 1400,
      "##li": 1401,
      "##list": 1402,
      "##licit": 1403,
      "##sh": 1404,
      "##sion": 1405,
      "##served": 1406,
      "##io": 1407,
      "##iq": 1408,
      "##ile": 1409,
      "##ire": 1410,
      "##iod": 1411,
      "##gth": 1412,
      "##nec": 1413,
      "##not": 1414,
      "##nically": 1415,
      "##day": 1416,
      "##down": 1417,
      "##rectly": 1418,
      "##up": 1419,
      "##und": 1420,
      "##ule": 1421,
      "##uably": 1422,
      "##mon": 1423,
      "##vir": 1424,
      "##vance": 1425,
      "##1d": 1426,
      "##197f": 1427,
      "##ted": 1428,
      "##tribute": 1429,
      "##aps": 1430,
      "##ft": 1431,
      "##ful": 1432,
      "##ways": 1433,
      "##hold": 1434,
      "##hnically": 1435,
      "##06": 1436,
      "##59": 1437,
      "##91": 1438,
      "##93": 1439,
      "##4s": 1440,
      "##8s": 1441,
      "##ken": 1442,
      "##35": 1443,
      "##33": 1444,
      "##onment": 1445,
      "##onds": 1446,
      "##erate": 1447,
      "thu": 1448,
      "thres": 1449,
      "##atform": 1450,
      "##inality": 1451,
      "##enient": 1452,
      "inform": 1453,
      "including": 1454,
      "##rove": 1455,
      "##roso": 1456,
      "##ecut": 1457,
      "cook": 1458,
      "##iler": 1459,
      "##ility": 1460,
      "isn": 1461,
      "std": 1462,
      "stable": 1463,
      "##thing": 1464,
      "off": 1465,
      "tolist": 1466,
      "today": 1467,
      "##lying": 1468,
      "##entified": 1469,
      "ext": 1470,
      "exten": 1471,
      "excluding": 1472,
      "##chment": 1473,
      "alt": 1474,
      "altern": 1475,
      "always": 1476,
      "aside": 1477,
      "##ical": 1478,
      "##icient": 1479,
      "##psed": 1480,
      "docstring": 1481,
      "##ugh": 1482,
      "repeated": 1483,
      "note": 1484,
      "without": 1485,
      "##ibly": 1486,
      "concat": 1487,
      "who": 1488,
      "why": 1489,
      "##ations": 1490,
      "advance": 1491,
      "##untu": 1492,
      "prop": 1493,
      "provid": 1494,
      "impact": 1495,
      "implicit": 1496,
      "improve": 1497,
      "introduc": 1498,
      "price": 1499,
      "try": 1500,
      "##ems": 1501,
      "issues": 1502,
      "struc": 1503,
      "valueerror": 1504,
      "106": 1505,
      "comment": 1506,
      "detect": 1507,
      "##idance": 1508,
      "som": 1509,
      "uses": 1510,
      "using": 1511,
      "uniq": 1512,
      "unnec": 1513,
      "##ifies": 1514,
      "gets": 1515,
      "##tachment": 1516,
      "short": 1517,
      "cannot": 1518,
      "envir": 1519,
      "##uction": 1520,
      "examples": 1521,
      "returned": 1522,
      "append": 1523,
      "appear": 1524,
      "later": 1525,
      "##bose": 1526,
      "##book": 1527,
      "##mitted": 1528,
      "suggested": 1529,
      "suggestion": 1530,
      "newly": 1531,
      "period": 1532,
      "permitted": 1533,
      "verbose": 1534,
      "##2026": 1535,
      "##pret": 1536,
      "location": 1537,
      "2024": 1538,
      "2026": 1539,
      "multi": 1540,
      "module": 1541,
      "modifies": 1542,
      "strings": 1543,
      "keys": 1544,
      "working": 1545,
      "datas": 1546,
      "sizes": 1547,
      "useful": 1548,
      "##322": 1549,
      "assets": 1550,
      "headers": 1551,
      "again": 1552,
      "calls": 1553,
      "many": 1554,
      "observed": 1555,
      "interpret": 1556,
      "datetimes": 1557,
      "simply": 1558,
      "assigned": 1559,
      "guard": 1560,
      "guide": 1561,
      "guidance": 1562,
      "ignore": 1563,
      "setup": 1564,
      "##fficient": 1565,
      "removing": 1566,
      "changing": 1567,
      "optionally": 1568,
      "applying": 1569,
      "attribute": 1570,
      "attachment": 1571,
      "goes": 1572,
      "good": 1573,
      "ratio": 1574,
      "seconds": 1575,
      "specified": 1576,
      "writing": 1577,
      "##1a197f": 1578,
      "steps": 1579,
      "validation": 1580,
      "validated": 1581,
      "supporting": 1582,
      "simplest": 1583,
      "simplify": 1584,
      "##cluded": 1585,
      "skiprows": 1586,
      "identified": 1587,
      "lev": 1588,
      "terms": 1589,
      "##ostic": 1590,
      "##nerab": 1591,
      "convenient": 1592,
      "possibly": 1593,
      "arguably": 1594,
      "chunksize": 1595,
      "ignores": 1596,
      "parameters": 1597,
      "means": 1598,
      "api": 1599,
      "create": 1600,
      "height": 1601,
      "img": 1602,
      "image": 1603,
      "overflow": 1604,
      "##x10": 1605,
      "those": 1606,
      "though": 1607,
      "requir": 1608,
      "require": 1609,
      "explain": 1610,
      "explicit": 1611,
      "consecut": 1612,
      "iterator": 1613,
      "present": 1614,
      "manual": 1615,
      "manually": 1616,
      "6522": 1617,
      "backward": 1618,
      "correctly": 1619,
      "differ": 1620,
      "handle": 1621,
      "libr": 1622,
      "merge": 1623,
      "ndarray": 1624,
      "path": 1625,
      "passed": 1626,
      "reduction": 1627,
      "slowdown": 1628,
      "typing": 1629,
      "underlying": 1630,
      "counter": 1631,
      "algos": 1632,
      "aligned": 1633,
      "actionable": 1634,
      "actual": 1635,
      "categorical": 1636,
      "idxm": 1637,
      "questions": 1638,
      "involve": 1639,
      "optimiz": 1640,
      "diagnostic": 1641,
      "astype": 1642,
      "bench": 1643,
      "clar": 1644,
      "certain": 1645,
      "cardinality": 1646,
      "during": 1647,
      "downcast": 1648,
      "either": 1649,
      "elapsed": 1650,
      "effects": 1651,
      "frame": 1652,
      "ge3ae055ab2": 1653,
      "git2026": 1654,
      "growing": 1655,
      "hooks": 1656,
      "human": 1657,
      "long": 1658,
      "length": 1659,
      "medi": 1660,
      "microso": 1661,
      "occur": 1662,
      "own": 1663,
      "platform": 1664,
      "push": 1665,
      "src": 1666,
      "technically": 1667,
      "ubuntu": 1668,
      "upload": 1669,
      "vulnerab": 1670,
      "wsl2": 1671,
      "width": 1672,
      "zero": 1673,
      "##061a197f": 1674,
      "threshold": 1675,
      "cookbook": 1676,
      "extension": 1677,
      "alternative": 1678,
      "introduced": 1679,
      "unique": 1680,
      "unnecess": 1681,
      "environment": 1682,
      "periods": 1683,
      "attachments": 1684,
      "consecutive": 1685,
      "git20260": 1686,
      "microsoft": 1687,
      "06": 1688,
      "08": 1689,
      "00000": 1690,
      "1x": 1691,
      "1322": 1692,
      "22": 1693,
      "21": 1694,
      "25": 1695,
      "28": 1696,
      "292": 1697,
      "32": 1698,
      "30": 1699,
      "35": 1700,
      "420": 1701,
      "4d9": 1702,
      "59": 1703,
      "56": 1704,
      "534": 1705,
      "5bb": 1706,
      "6e": 1707,
      "65": 1708,
      "69": 1709,
      "635": 1710,
      "700": 1711,
      "732": 1712,
      "759": 1713,
      "793": 1714,
      "82": 1715,
      "87": 1716,
      "89": 1717,
      "84": 1718,
      "9c": 1719,
      "9d": 1720,
      "99": 1721,
      "930": 1722,
      "av": 1723,
      "af": 1724,
      "apr": 1725,
      "ba": 1726,
      "ber": 1727,
      "bin": 1728,
      "bro": 1729,
      "bad": 1730,
      "byp": 1731,
      "best": 1732,
      "big": 1733,
      "bac": 1734,
      "base": 1735,
      "bare": 1736,
      "b061a197f": 1737,
      "cp": 1738,
      "cat": 1739,
      "cle": 1740,
      "cum": 1741,
      "clo": 1742,
      "cau": 1743,
      "cpython": 1744,
      "cause": 1745,
      "dec": 1746,
      "dum": 1747,
      "due": 1748,
      "dist": 1749,
      "eo": 1750,
      "eu": 1751,
      "end": 1752,
      "ear": 1753,
      "evid": 1754,
      "e3ae055ab2": 1755,
      "efficient": 1756,
      "fa": 1757,
      "fin": 1758,
      "few": 1759,
      "f64": 1760,
      "fri": 1761,
      "full": 1762,
      "fact": 1763,
      "fund": 1764,
      "f91": 1765,
      "gi": 1766,
      "glib": 1767,
      "hon": 1768,
      "hor": 1769,
      "hit": 1770,
      "had": 1771,
      "high": 1772,
      "hdf": 1773,
      "jun": 1774,
      "let": 1775,
      "lot": 1776,
      "lay": 1777,
      "lim": 1778,
      "less": 1779,
      "line": 1780,
      "luc": 1781,
      "md": 1782,
      "my": 1783,
      "mis": 1784,
      "mess": 1785,
      "nat": 1786,
      "nas": 1787,
      "nul": 1788,
      "nic": 1789,
      "nice": 1790,
      "nich": 1791,
      "native": 1792,
      "omit": 1793,
      "pe": 1794,
      "pers": 1795,
      "pot": 1796,
      "pol": 1797,
      "pure": 1798,
      "pain": 1799,
      "rf": 1800,
      "rul": 1801,
      "rang": 1802,
      "right": 1803,
      "rich": 1804,
      "roo": 1805,
      "r30": 1806,
      "sl": 1807,
      "sw": 1808,
      "sit": 1809,
      "sing": 1810,
      "san": 1811,
      "sil": 1812,
      "sent": 1813,
      "say": 1814,
      "sur": 1815,
      "sem": 1816,
      "says": 1817,
      "schem": 1818,
      "ts": 1819,
      "tre": 1820,
      "tue": 1821,
      "test": 1822,
      "tel": 1823,
      "upp": 1824,
      "vs": 1825,
      "var": 1826,
      "wr": 1827,
      "war": 1828,
      "wis": 1829,
      "ways": 1830,
      "yi": 1831,
      "your": 1832,
      "±in": 1833,
      "##om": 1834,
      "##ose": 1835,
      "##ops": 1836,
      "##over": 1837,
      "##oid": 1838,
      "##ople": 1839,
      "##ome": 1840,
      "##bp": 1841,
      "##b1": 1842,
      "##bst": 1843,
      "##b68": 1844,
      "##b322": 1845,
      "##xown": 1846,
      "##c2": 1847,
      "##c1": 1848,
      "##ct": 1849,
      "##ca": 1850,
      "##c4": 1851,
      "##c8": 1852,
      "##cle": 1853,
      "##cel": 1854,
      "##cord": 1855,
      "##caf": 1856,
      "##cbb": 1857,
      "##eve": 1858,
      "##eps": 1859,
      "##efficient": 1860,
      "##lf": 1861,
      "##lin": 1862,
      "##lic": 1863,
      "##lies": 1864,
      "##ses": 1865,
      "##sing": 1866,
      "##sum": 1867,
      "##set": 1868,
      "##sest": 1869,
      "##spect": 1870,
      "##2a": 1871,
      "##28": 1872,
      "##235": 1873,
      "##ier": 1874,
      "##iou": 1875,
      "##gs": 1876,
      "##ged": 1877,
      "##gard": 1878,
      "##gree": 1879,
      "##gations": 1880,
      "##ns": 1881,
      "##ny": 1882,
      "##ning": 1883,
      "##da": 1884,
      "##d5": 1885,
      "##date": 1886,
      "##dition": 1887,
      "##red": 1888,
      "##ract": 1889,
      "##uce": 1890,
      "##uage": 1891,
      "##uss": 1892,
      "##uple": 1893,
      "##pe": 1894,
      "##pt": 1895,
      "##ped": 1896,
      "##ping": 1897,
      "##par": 1898,
      "##ms": 1899,
      "##mas": 1900,
      "##mot": 1901,
      "##ves": 1902,
      "##val": 1903,
      "##vant": 1904,
      "##viou": 1905,
      "##1s": 1906,
      "##10": 1907,
      "##15": 1908,
      "##100": 1909,
      "##ts": 1910,
      "##tes": 1911,
      "##tly": 1912,
      "##tally": 1913,
      "##tang": 1914,
      "##ture": 1915,
      "##ax": 1916,
      "##a8": 1917,
      "##ave": 1918,
      "##aight": 1919,
      "##ape": 1920,
      "##fo": 1921,
      "##fic": 1922,
      "##fession": 1923,
      "##filer": 1924,
      "##ze": 1925,
      "##zone": 1926,
      "##zdtype": 1927,
      "##7s": 1928,
      "##79": 1929,
      "##700": 1930,
      "##7c1": 1931,
      "##72a": 1932,
      "##yon": 1933,
      "##yle": 1934,
      "##word": 1935,
      "##hat": 1936,
      "##hing": 1937,
      "##how": 1938,
      "##haps": 1939,
      "##hape": 1940,
      "##02": 1941,
      "##01": 1942,
      "##5d": 1943,
      "##51a": 1944,
      "##983": 1945,
      "##9ca": 1946,
      "##97c1": 1947,
      "##49": 1948,
      "##44": 1949,
      "##4cbb": 1950,
      "##472a": 1951,
      "##63": 1952,
      "##6ec": 1953,
      "##612": 1954,
      "##691": 1955,
      "##6b322": 1956,
      "##6700": 1957,
      "##84": 1958,
      "##8b68": 1959,
      "##828": 1960,
      "##330": 1961,
      "##370": 1962,
      "##36ec": 1963,
      "##ontally": 1964,
      "##eral": 1965,
      "##ered": 1966,
      "thes": 1967,
      "throws": 1968,
      "##ating": 1969,
      "##ines": 1970,
      "##ined": 1971,
      "##ining": 1972,
      "##inel": 1973,
      "##inting": 1974,
      "##inct": 1975,
      "##nded": 1976,
      "##nding": 1977,
      "nonetype": 1978,
      "##orith": 1979,
      "##orize": 1980,
      "##alar": 1981,
      "##ason": 1982,
      "they": 1983,
      "their": 1984,
      "##itut": 1985,
      "##itch": 1986,
      "##itation": 1987,
      "##ities": 1988,
      "##itory": 1989,
      "##itions": 1990,
      "##ionable": 1991,
      "##ings": 1992,
      "##sts": 1993,
      "##stand": 1994,
      "##enate": 1995,
      "##eness": 1996,
      "##ared": 1997,
      "##arly": 1998,
      "##arting": 1999,
      "##aries": 2000,
      "##arou": 2001,
      "##arily": 2002,
      "##areness": 2003,
      "inclu": 2004,
      "input": 2005,
      "infer": 2006,
      "included": 2007,
      "inefficient": 2008,
      "inspect": 2009,
      "info": 2010,
      "ref": 2011,
      "reach": 2012,
      "reject": 2013,
      "refer": 2014,
      "render": 2015,
      "regard": 2016,
      "reason": 2017,
      "##anning": 2018,
      "##ecation": 2019,
      "##ecac": 2020,
      "cost": 2021,
      "cover": 2022,
      "couple": 2023,
      "##umerate": 2024,
      "##eties": 2025,
      "##etzdtype": 2026,
      "##ething": 2027,
      "##ilities": 2028,
      "style": 2029,
      "starting": 2030,
      "##ising": 2031,
      "##isation": 2032,
      "##isions": 2033,
      "##ams": 2034,
      "often": 2035,
      "##reme": 2036,
      "##regations": 2037,
      "tos": 2038,
      "top": 2039,
      "tool": 2040,
      "##aded": 2041,
      "##adata": 2042,
      "##vels": 2043,
      "##ents": 2044,
      "##ented": 2045,
      "##entation": 2046,
      "##ential": 2047,
      "once": 2048,
      "exce": 2049,
      "exte": 2050,
      "excluded": 2051,
      "excel": 2052,
      "##ches": 2053,
      "##chang": 2054,
      "doing": 2055,
      "being": 2056,
      "below": 2057,
      "beli": 2058,
      "beyon": 2059,
      "alone": 2060,
      "##icy": 2061,
      "##ictly": 2062,
      "depr": 2063,
      "deep": 2064,
      "demon": 2065,
      "degree": 2066,
      "force": 2067,
      "forward": 2068,
      "##sequ": 2069,
      "##seable": 2070,
      "##self": 2071,
      "indexing": 2072,
      "having": 2073,
      "##estig": 2074,
      "repro": 2075,
      "repla": 2076,
      "repos": 2077,
      "repres": 2078,
      "##ately": 2079,
      "##atever": 2080,
      "##ibe": 2081,
      "##ural": 2082,
      "contain": 2083,
      "condition": 2084,
      "consequ": 2085,
      "what": 2086,
      "while": 2087,
      "whatever": 2088,
      "##elds": 2089,
      "##elines": 2090,
      "its": 2091,
      "items": 2092,
      "##00x20": 2093,
      "##0001": 2094,
      "##istently": 2095,
      "##plied": 2096,
      "reader": 2097,
      "prod": 2098,
      "progr": 2099,
      "project": 2100,
      "promot": 2101,
      "profession": 2102,
      "##ulty": 2103,
      "into": 2104,
      "introd": 2105,
      "bugs": 2106,
      "##igure": 2107,
      "##essure": 2108,
      "prone": 2109,
      "printing": 2110,
      "pressure": 2111,
      "point": 2112,
      "##loaded": 2113,
      "devs": 2114,
      "straight": 2115,
      "strictly": 2116,
      "1079": 2117,
      "1084": 2118,
      "##ewhat": 2119,
      "##ineers": 2120,
      "##eader": 2121,
      "common": 2122,
      "reporting": 2123,
      "determ": 2124,
      "loss": 2125,
      "look": 2126,
      "looks": 2127,
      "loops": 2128,
      "logs": 2129,
      "##idered": 2130,
      "used": 2131,
      "usable": 2132,
      "unable": 2133,
      "unless": 2134,
      "unset": 2135,
      "unchang": 2136,
      "##kend": 2137,
      "configure": 2138,
      "64691": 2139,
      "respect": 2140,
      "reshape": 2141,
      "##libs": 2142,
      "show": 2143,
      "shown": 2144,
      "##tured": 2145,
      "splitter": 2146,
      "both": 2147,
      "bound": 2148,
      "enumerate": 2149,
      "taken": 2150,
      "##avy": 2151,
      "returning": 2152,
      "design": 2153,
      "keeps": 2154,
      "link": 2155,
      "##pective": 2156,
      "added": 2157,
      "additions": 2158,
      "floats": 2159,
      "##books": 2160,
      "##ache": 2161,
      "compos": 2162,
      "compile": 2163,
      "compiler": 2164,
      "complic": 2165,
      "compared": 2166,
      "describe": 2167,
      "suggests": 2168,
      "aws": 2169,
      "away": 2170,
      "awareness": 2171,
      "perhaps": 2172,
      "worth": 2173,
      "worse": 2174,
      "##prising": 2175,
      "##forward": 2176,
      "behaves": 2177,
      "important": 2178,
      "modified": 2179,
      "subst": 2180,
      "##mending": 2181,
      "stringarray": 2182,
      "stringdtype": 2183,
      "behaviour": 2184,
      "scop": 2185,
      "scalar": 2186,
      "scanning": 2187,
      "##52472a": 2188,
      "results": 2189,
      "keyword": 2190,
      "workarou": 2191,
      "built": 2192,
      "accord": 2193,
      "cycle": 2194,
      "fastest": 2195,
      "knxown": 2196,
      "nans": 2197,
      "pipelines": 2198,
      "##tempt": 2199,
      "relevant": 2200,
      "implemented": 2201,
      "implementing": 2202,
      "multiplies": 2203,
      "builds": 2204,
      "become": 2205,
      "generate": 2206,
      "general": 2207,
      "heading": 2208,
      "language": 2209,
      "match": 2210,
      "##a2de": 2211,
      "stackover": 2212,
      "operator": 2213,
      "somehow": 2214,
      "140": 2215,
      "147s": 2216,
      "26100": 2217,
      "calling": 2218,
      "callers": 2219,
      "callable": 2220,
      "funny": 2221,
      "failure": 2222,
      "manage": 2223,
      "manner": 2224,
      "formats": 2225,
      "datetimetzdtype": 2226,
      "guess": 2227,
      "nothing": 2228,
      "setting": 2229,
      "setde": 2230,
      "##izontally": 2231,
      "##depend": 2232,
      "##9b59": 2233,
      "removal": 2234,
      "changed": 2235,
      "1500x20": 2236,
      "attempt": 2237,
      "goal": 2238,
      "going": 2239,
      "parseable": 2240,
      "seems": 2241,
      "separ": 2242,
      "secure": 2243,
      "specify": 2244,
      "webp": 2245,
      "written": 2246,
      "##tuples": 2247,
      "##ency": 2248,
      "##ences": 2249,
      "supports": 2250,
      "aggregations": 2251,
      "simpler": 2252,
      "simplified": 2253,
      "skipped": 2254,
      "174s": 2255,
      "1001d": 2256,
      "gb061a197f": 2257,
      "least": 2258,
      "leave": 2259,
      "levels": 2260,
      "previou": 2261,
      "quite": 2262,
      "quality": 2263,
      "##osed": 2264,
      "##345d": 2265,
      "invented": 2266,
      "investig": 2267,
      "depending": 2268,
      "defaults": 2269,
      "contribute": 2270,
      "contents": 2271,
      "completes": 2272,
      "knowing": 2273,
      "datetime64": 2274,
      "datetimeindex": 2275,
      "flags": 2276,
      "ability": 2277,
      "applied": 2278,
      "apache": 2279,
      "created": 2280,
      "creates": 2281,
      "heart": 2282,
